Revit 2024 API
ParameterTypeId.SteelElemBoltTotalWeight Property
 "Total Weight"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId SteelElemBoltTotalWeight { get; }
Visual Basic
Public Shared ReadOnly Property SteelElemBoltTotalWeight As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ SteelElemBoltTotalWeight {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace